In [36]:
# Ne kete file jan rregjistruar kliente nga vende te ndryshme dhe jane rregj blerjet e tyre, sasia, lloji dhe cmimi per produkt
# do te gjejme cili shtet ka me shume blerje
# do te shoshim tek ky shtet totalin e blerjeve * cmimin, sa eshte harxhuar

In [37]:
import pandas as pd
import numpy as np

In [38]:
# hapja e nje file 'big' ne excel dhe konvertimi i tij ne csv
data = pd.read_excel("Online retail.xlsx")
data.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10000 non-null  object
 1   StockCode    10000 non-null  object
 2   Description  9958 non-null   object
 3   Quantity     10000 non-null  int64
 4   InvoiceDate  10000 non-null  datetime64[ns]
 5   UnitPrice    10000 non-null  float64
 6   CustomerID   7709 non-null   float64
 7   Country      10000 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 625.1+ KB

In [40]:
data.to_csv("NwData.csv", index = False)

In [41]:
data = pd.read_csv("NwData.csv")
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10000 non-null  object
 1   StockCode    10000 non-null  object
 2   Description  9958 non-null   object
 3   Quantity     10000 non-null  int64
 4   InvoiceDate  10000 non-null  object
 5   UnitPrice    10000 non-null  float64
 6   CustomerID   7709 non-null   float64
 7   Country      10000 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 625.1+ KB

In [43]:
# per kerkesat e mia po heq disa kolona
data.drop(['Description','CustomerID', 'InvoiceDate'],axis='columns', inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   InvoiceNo  10000 non-null  object
 1   StockCode  10000 non-null  object
 2   Quantity   10000 non-null  int64
 3   UnitPrice  10000 non-null  float64
 4   Country    10000 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 390.8+ KB

In [44]:
# gjej sa nr unik faturash kam, keshtu gjej dhe sa 
# fatura me jane gjeneruar ne kete hapeise kohe
data['InvoiceNo'].nunique()

512

In [45]:
data['StockCode'].nunique() # mund te them qe kam 2015 produkte

2015

In [46]:
data['Quantity'].isna().sum().sum() # nuk kam asnje velere boshe NA tek kolona quantitu

0

In [47]:
# shohim nga leximet me 
# siper qe ne te dhenat e mia nuk kam nje index unik ytekolonave ekzistuese
# mund te shtoj nje kolone id
data['id_data']= range(1, 10001)
data.head()

  InvoiceNo StockCode  Quantity  UnitPrice         Country  id_data
0    536365    85123A         6       2.55  United Kingdom        1
1    536365     71053         6       3.39  United Kingdom        2
2    536365    84406B         8       2.75  United Kingdom        3
3    536365    84029G         6       3.39  United Kingdom        4
4    536365    84029E         6       3.39  United Kingdom        5

In [48]:
data.to_csv("NwData.csv", index=False)

In [49]:
data = pd.read_csv("NwData.csv", index_col="id_data")
data.head()

        InvoiceNo StockCode  Quantity  UnitPrice         Country
id_data
1          536365    85123A         6       2.55  United Kingdom
2          536365     71053         6       3.39  United Kingdom
3          536365    84406B         8       2.75  United Kingdom
4          536365    84029G         6       3.39  United Kingdom
5          536365    84029E         6       3.39  United Kingdom

In [50]:
data.drop_duplicates(inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9804 entries, 1 to 10000
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   InvoiceNo  9804 non-null   object
 1   StockCode  9804 non-null   object
 2   Quantity   9804 non-null   int64
 3   UnitPrice  9804 non-null   float64
 4   Country    9804 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 459.6+ KB

In [51]:
data.describe()

          Quantity    UnitPrice
count  9804.000000  9804.000000
mean      7.945328     3.866496
std     105.355599    14.448900
min   -9360.000000     0.000000
25%       1.000000     1.250000
50%       3.000000     2.510000
75%       8.000000     4.210000
max    2880.000000   887.520000

https://statisticsbyjim.com/basics/outliers/   study outliers

# Outliers

Outliers are data points that are far from other data points. In other words, they’reunusual values in a dataset. Outliers are problematic for many statistical analyses because they can cause tests to either miss significant findings or distort real results.

In [54]:
def drop_outliers(data):
    q1 = data.quantile(0.25)
    q3 = data.quantile(0.75)
    
    iqr = q3 - q1 # Interquartile range
    lower_bound = q1 - 1.5 * iqr
    upper_bound = q3 + 1.5 * iqr
    
    return data[(data > lower_bound) & (data < upper_bound)]

In [56]:
data['Quantity'] = drop_outliers(data['Quantity'])
data['Quantity'].describe()

count    8696.000000
mean        3.870860
std         3.731685
min        -6.000000
25%         1.000000
50%         2.000000
75%         6.000000
max        13.000000
Name: Quantity, dtype: float64

In [ ]:
Outliers are data points that are far from other data points. In other words, they’re unusual values in a dataset. Outliers are problematic for many statistical analyses because they can cause tests to either miss significant findings or distort real results.